Contact-service/deleteContact.yml
config:
  target: "https://staging-dashboard.cliquidator.info"
  tls: 
    rejectUnauthorized: false
  processor: '../login_processor.js' 
  phases:
    - name: "load testing"
      duration: 2
      arrivalRate: 1

scenarios:
  - name: "Get Info"
    flow:
      - function: "getToken"
      - delete:
          url: "/v1/contacts/info"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"